comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_TwitterCluster1_Benchmarking/RocksDB_0.1B_in0.8B_val267_mem64MB_Cluster1_CT04_level1base512_targetbase64_Blk4_Blkcache512_Tabcache10000.log
RocksDB:    version 9.4.0
Date:       Mon May 12 19:14:18 2025
CPU:        112 * Intel(R) Xeon(R) Gold 6348 CPU @ 2.60GHz
CPUCache:   43008 KB
workload_num: 100000000 entries_per_batch_:1
 The key size:80 value size:128 
The k_size:80 The v_size:267 
rocksdb.block-cache-usage COUNT : 35595160
rocksdb.block-cache-pinned-usage COUNT : 88
rocksdb.estimate-table-readers-mem COUNT : 1036312
Total bytes written: 144
Set seed to 1747048457905839 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       80 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    800000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    158691.4 MB (estimated)
FileSize:   61035.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 5
------------------------------------------------
DB path: [/mnt/db_test/rocks10B/Cluster1_0.8B_mem64MB_CT4_L1base512_targetbase64_Block4]
the row_data[5] is:get
the row_data[5] is:get
the row_data[5] is:get
[...]
clusterQuery :       2.176 micros/op 459502 ops/sec 217.279 seconds 99840311 operations;   63.9 MB/s PERF_CONTEXT:
user_key_comparison_count = 2221268062, block_cache_hit_count = 4026434, block_read_count = 8492, block_read_byte = 34004900, block_read_time = 1371001946, block_read_cpu_time = 174950761, block_cache_index_hit_count = 0, block_cache_standalone_handle_count = 0, block_cache_real_handle_count = 0, index_block_read_count = 0, block_cache_filter_hit_count = 0, filter_block_read_count = 0, compression_dict_block_read_count = 0, block_cache_index_read_byte = 0, block_cache_filter_read_byte = 0, block_cache_compression_dict_read_byte = 0, block_cache_read_byte = 16556913824, secondary_cache_hit_count = 0, compressed_sec_cache_insert_real_count = 0, compressed_sec_cache_insert_dummy_count = 0, compressed_sec_cache_uncompressed_bytes = 0, compressed_sec_cache_compressed_bytes = 0, block_checksum_time = 3905685, block_decompress_time = 0, get_read_bytes = 26525215926, multiget_read_bytes = 0, iter_read_bytes = 0, blob_cache_hit_count = 0, blob_read_count = 0, blob_read_byte = 0, blob_read_time = 0, blob_checksum_time = 0, blob_decompress_time = 0, internal_key_skipped_count = 0, internal_delete_skipped_count = 0, internal_recent_skipped_count = 0, internal_merge_count = 0, internal_merge_point_lookup_count = 0, internal_range_del_reseek_count = 0, get_snapshot_time = 6529098670, get_from_memtable_time = 62203425125, get_from_memtable_count = 99394005, get_post_process_time = 8723803545, get_from_output_files_time = 8924835896, seek_on_memtable_time = 0, seek_on_memtable_count = 0, next_on_memtable_count = 0, prev_on_memtable_count = 0, seek_child_seek_time = 0, seek_child_seek_count = 0, seek_min_heap_time = 0, seek_max_heap_time = 0, seek_internal_seek_time = 0, find_next_user_entry_time = 0, write_wal_time = 1427753864, write_memtable_time = 720763538, write_delay_time = 0, write_scheduling_flushes_compactions_time = 30470024, write_pre_and_post_process_time = 146221143, write_thread_wait_nanos = 0, db_mutex_lock_nanos = 0, db_condition_wait_nanos = 0, merge_operator_time_nanos = 0, read_index_block_nanos = 0, read_filter_block_nanos = 0, new_table_block_iter_nanos = 2601925168, new_table_iterator_nanos = 0, block_seek_nanos = 2665342331, find_table_nanos = 0, bloom_memtable_hit_count = 0, bloom_memtable_miss_count = 0, bloom_sst_hit_count = 4034900, bloom_sst_miss_count = 70793, key_lock_wait_time = 0, key_lock_wait_count = 0, env_new_sequential_file_nanos = 0, env_new_random_access_file_nanos = 0, env_new_writable_file_nanos = 0, env_reuse_writable_file_nanos = 0, env_new_random_rw_file_nanos = 0, env_new_directory_nanos = 0, env_file_exists_nanos = 0, env_get_children_nanos = 0, env_get_children_file_attributes_nanos = 0, env_delete_file_nanos = 0, env_create_dir_nanos = 0, env_create_dir_if_missing_nanos = 0, env_delete_dir_nanos = 0, env_get_file_size_nanos = 0, env_get_file_modification_time_nanos = 0, env_rename_file_nanos = 0, env_link_file_nanos = 0, env_lock_file_nanos = 0, env_unlock_file_nanos = 0, env_new_logger_nanos = 0, get_cpu_nanos = 125298953660, iter_next_cpu_nanos = 0, iter_prev_cpu_nanos = 0, iter_seek_cpu_nanos = 0, iter_next_count = 0, iter_prev_count = 0, iter_seek_count = 0, encrypt_data_nanos = 0, decrypt_data_nanos = 0, number_async_seek = 0, bloom_filter_useful = 70793@level0, 0@level1, bloom_filter_full_positive = 3978808@level0, 56092@level1, bloom_filter_full_true_positive = 3977889@level0, 56092@level1, user_key_return_count = 3977889@level0, 56092@level1, get_from_table_nanos = 7138573092@level0, 800687338@level1, block_cache_hit_count = 3973816@level0, 52618@level1, block_cache_miss_count = 5018@level0, 3474@level1
Microseconds per read:
Count: 99345378 Average: 2.1565  StdDev: 1.98
Min: 1  Median: 1.5561  Max: 4810
Percentiles: P50: 1.56 P75: 1.87 P99: 3.91 P99.9: 5.91 P99.99: 15.59
------------------------------------------------------
[       0,       1 ]  5303832   5.339%   5.339% #
(       1,       2 ] 79781698  80.307%  85.646% ################
(       2,       3 ] 10163305  10.230%  95.876% ##
(       3,       4 ]  3412868   3.435%  99.312% #
(       4,       6 ]   612052   0.616%  99.928% 
(       6,      10 ]    44926   0.045%  99.973% 
(      10,      15 ]    16658   0.017%  99.990% 
(      15,      22 ]     1246   0.001%  99.991% 
(      22,      34 ]      210   0.000%  99.991% 
(      34,      51 ]       95   0.000%  99.991% 
(      51,      76 ]      592   0.001%  99.992% 
(      76,     110 ]     1606   0.002%  99.994% 
(     110,     170 ]      820   0.001%  99.994% 
(     170,     250 ]     5019   0.005% 100.000% 
(     250,     380 ]      425   0.000% 100.000% 
(     380,     580 ]       11   0.000% 100.000% 
(     580,     870 ]        4   0.000% 100.000% 
(     870,    1300 ]        4   0.000% 100.000% 
(    1300,    1900 ]        3   0.000% 100.000% 
(    2900,    4400 ]        3   0.000% 100.000% 
(    4400,    6600 ]        1   0.000% 100.000% 

Microseconds per write:
Count: 494933 Average: 6.1459  StdDev: 43.53
Min: 3  Median: 5.1672  Max: 12360
Percentiles: P50: 5.17 P75: 6.29 P99: 12.88 P99.9: 14.95 P99.99: 141.17
------------------------------------------------------
(       2,       3 ]        6   0.001%   0.001% 
(       3,       4 ]    86465  17.470%  17.471% ###
(       4,       6 ]   275865  55.738%  73.209% ###########
(       6,      10 ]   121444  24.537%  97.747% #####
(      10,      15 ]    10764   2.175%  99.921% 
(      15,      22 ]      311   0.063%  99.984% 
(      22,      34 ]        8   0.002%  99.986% 
(      34,      51 ]        4   0.001%  99.987% 
(      51,      76 ]        1   0.000%  99.987% 
(      76,     110 ]        2   0.000%  99.987% 
(     110,     170 ]       26   0.005%  99.993% 
(     170,     250 ]       16   0.003%  99.996% 
(     250,     380 ]        2   0.000%  99.996% 
(     380,     580 ]        1   0.000%  99.996% 
(    1300,    1900 ]        1   0.000%  99.997% 
(    2900,    4400 ]        1   0.000%  99.997% 
(    4400,    6600 ]        5   0.001%  99.998% 
(    6600,    9900 ]       10   0.002% 100.000% 
(    9900,   14000 ]        1   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   19.96 MB   0.8      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0    122.5      0.16              0.08         3    0.054       0      0       0.0       0.0
  L1      1/0   16.92 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum      4/0   36.88 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0    122.5      0.16              0.08         3    0.054       0      0       0.0       0.0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0    112.6      0.12              0.08         2    0.061       0      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0    112.6      0.12              0.08         2    0.061       0      0       0.0       0.0
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0    151.4      0.04              0.00         1    0.042       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 217.6 total, 217.3 interval
Flush(GB): cumulative 0.019, interval 0.013
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.02 GB write, 0.09 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.2 seconds
Interval compaction: 0.01 GB write, 0.06 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.1 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x64a05d0b6b00#1237798 capacity: 512.00 MB seed: 1790781103 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 0 last_secs: 0.000121 secs_since: 217
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **
** Level 0 read latency histogram (micros):
Count: 5021 Average: 147.5688  StdDev: 114.94
Min: 51  Median: 145.1297  Max: 3269
Percentiles: P50: 145.13 P75: 204.88 P99: 312.87 P99.9: 1893.70 P99.99: 3269.00
------------------------------------------------------
(      34,      51 ]        2   0.040%   0.040% 
(      51,      76 ]     1382  27.524%  27.564% ######
(      76,     110 ]      630  12.547%  40.112% ###
(     110,     170 ]      848  16.889%  57.001% ###
(     170,     250 ]     2073  41.287%  98.287% ########
(     250,     380 ]       74   1.474%  99.761% 
(     380,     580 ]        1   0.020%  99.781% 
(     580,     870 ]        3   0.060%  99.841% 
(     870,    1300 ]        1   0.020%  99.861% 
(    1300,    1900 ]        2   0.040%  99.900% 
(    1900,    2900 ]        1   0.020%  99.920% 
(    2900,    4400 ]        4   0.080% 100.000% 

** Level 1 read latency histogram (micros):
Count: 3475 Average: 181.9209  StdDev: 76.87
Min: 52  Median: 196.9475  Max: 3305
Percentiles: P50: 196.95 P75: 224.57 P99: 316.46 P99.9: 377.14 P99.99: 3305.00
------------------------------------------------------
(      51,      76 ]       83   2.388%   2.388% 
(      76,     110 ]      449  12.921%  15.309% ###
(     110,     170 ]      358  10.302%  25.612% ##
(     170,     250 ]     2516  72.403%  98.014% ##############
(     250,     380 ]       67   1.928%  99.942% 
(    1900,    2900 ]        1   0.029%  99.971% 
(    2900,    4400 ]        1   0.029% 100.000% 


** DB Stats **
Uptime(secs): 217.6 total, 217.3 interval
Cumulative writes: 494K writes, 494K keys, 494K commit groups, 1.0 writes per commit group, ingest: 0.17 GB, 0.79 MB/s
Cumulative WAL: 494K writes, 0 syncs, 494933.00 writes per sync, written: 0.17 GB, 0.79 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 494K writes, 494K keys, 494K commit groups, 1.0 writes per commit group, ingest: 171.34 MB, 0.79 MB/s
Interval WAL: 494K writes, 0 syncs, 494933.00 writes per sync, written: 0.17 GB, 0.79 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0

STATISTICS:
rocksdb.block.cache.miss COUNT : 8492
rocksdb.block.cache.hit COUNT : 4026434
rocksdb.block.cache.add COUNT : 8492
rocksdb.block.cache.add.failures COUNT : 0
rocksdb.block.cache.index.miss COUNT : 0
rocksdb.block.cache.index.hit COUNT : 0
rocksdb.block.cache.index.add COUNT : 0
rocksdb.block.cache.index.bytes.insert COUNT : 0
rocksdb.block.cache.filter.miss COUNT : 0
rocksdb.block.cache.filter.hit COUNT : 0
rocksdb.block.cache.filter.add COUNT : 0
rocksdb.block.cache.filter.bytes.insert COUNT : 0
rocksdb.block.cache.data.miss COUNT : 8492
rocksdb.block.cache.data.hit COUNT : 4026434
rocksdb.block.cache.data.add COUNT : 8492
rocksdb.block.cache.data.bytes.insert COUNT : 34836736
rocksdb.block.cache.bytes.read COUNT : 16556913824
rocksdb.block.cache.bytes.write COUNT : 34836736
rocksdb.block.cache.compression.dict.miss COUNT : 0
rocksdb.block.cache.compression.dict.hit COUNT : 0
rocksdb.block.cache.compression.dict.add COUNT : 0
rocksdb.block.cache.compression.dict.bytes.insert COUNT : 0
rocksdb.block.cache.add.redundant COUNT : 0
rocksdb.block.cache.index.add.redundant COUNT : 0
rocksdb.block.cache.filter.add.redundant COUNT : 0
rocksdb.block.cache.data.add.redundant COUNT : 0
rocksdb.block.cache.compression.dict.add.redundant COUNT : 0
rocksdb.secondary.cache.hits COUNT : 0
rocksdb.secondary.cache.filter.hits COUNT : 0
rocksdb.secondary.cache.index.hits COUNT : 0
rocksdb.secondary.cache.data.hits COUNT : 0
rocksdb.compressed.secondary.cache.dummy.hits COUNT : 0
rocksdb.compressed.secondary.cache.hits COUNT : 0
rocksdb.compressed.secondary.cache.promotions COUNT : 0
rocksdb.compressed.secondary.cache.promotion.skips COUNT : 0
rocksdb.bloom.filter.useful COUNT : 70793
rocksdb.bloom.filter.full.positive COUNT : 4034900
rocksdb.bloom.filter.full.true.positive COUNT : 4033981
rocksdb.bloom.filter.prefix.checked COUNT : 0
rocksdb.bloom.filter.prefix.useful COUNT : 0
rocksdb.bloom.filter.prefix.true.positive COUNT : 0
rocksdb.persistent.cache.hit COUNT : 0
rocksdb.persistent.cache.miss COUNT : 0
rocksdb.sim.block.cache.hit COUNT : 0
rocksdb.sim.block.cache.miss COUNT : 0
rocksdb.memtable.hit COUNT : 95311397
rocksdb.memtable.miss COUNT : 4033981
rocksdb.l0.hit COUNT : 3977889
rocksdb.l1.hit COUNT : 56092
rocksdb.l2andup.hit COUNT : 0
rocksdb.compaction.key.drop.new COUNT : 0
rocksdb.compaction.key.drop.obsolete COUNT : 0
rocksdb.compaction.key.drop.range_del COUNT : 0
rocksdb.compaction.key.drop.user COUNT : 0
rocksdb.compaction.range_del.drop.obsolete COUNT : 0
rocksdb.compaction.optimized.del.drop.obsolete COUNT : 0
rocksdb.compaction.cancelled COUNT : 0
rocksdb.number.keys.written COUNT : 494933
rocksdb.number.keys.read COUNT : 99345378
rocksdb.number.keys.updated COUNT : 0
rocksdb.bytes.written COUNT : 179660679
rocksdb.bytes.read COUNT : 26525215926
rocksdb.number.db.seek COUNT : 0
rocksdb.number.db.next COUNT : 0
rocksdb.number.db.prev COUNT : 0
rocksdb.number.db.seek.found COUNT : 0
rocksdb.number.db.next.found COUNT : 0
rocksdb.number.db.prev.found COUNT : 0
rocksdb.db.iter.bytes.read COUNT : 0
rocksdb.number.iter.skip COUNT : 0
rocksdb.number.reseeks.iteration COUNT : 0
rocksdb.num.iterator.created COUNT : 0
rocksdb.num.iterator.deleted COUNT : 0
rocksdb.no.file.opens COUNT : 4
rocksdb.no.file.errors COUNT : 0
rocksdb.stall.micros COUNT : 0
rocksdb.db.mutex.wait.micros COUNT : 0
rocksdb.number.multiget.get COUNT : 0
rocksdb.number.multiget.keys.read COUNT : 0
rocksdb.number.multiget.bytes.read COUNT : 0
rocksdb.number.multiget.keys.found COUNT : 0
rocksdb.number.merge.failures COUNT : 0
rocksdb.getupdatessince.calls COUNT : 0
rocksdb.wal.synced COUNT : 0
rocksdb.wal.bytes COUNT : 179660679
rocksdb.write.self COUNT : 494933
rocksdb.write.other COUNT : 0
rocksdb.write.wal COUNT : 494933
rocksdb.compact.read.bytes COUNT : 0
rocksdb.compact.write.bytes COUNT : 6590449
rocksdb.flush.write.bytes COUNT : 14335556
rocksdb.compact.read.marked.bytes COUNT : 0
rocksdb.compact.read.periodic.bytes COUNT : 0
rocksdb.compact.read.ttl.bytes COUNT : 0
rocksdb.compact.write.marked.bytes COUNT : 0
rocksdb.compact.write.periodic.bytes COUNT : 0
rocksdb.compact.write.ttl.bytes COUNT : 0
rocksdb.number.direct.load.table.properties COUNT : 0
rocksdb.number.superversion_acquires COUNT : 5
rocksdb.number.superversion_releases COUNT : 1
rocksdb.number.superversion_cleanups COUNT : 1
rocksdb.number.block.compressed COUNT : 0
rocksdb.number.block.decompressed COUNT : 0
rocksdb.bytes.compressed.from COUNT : 0
rocksdb.bytes.compressed.to COUNT : 0
rocksdb.bytes.compression_bypassed COUNT : 20807202
rocksdb.bytes.compression.rejected COUNT : 0
rocksdb.number.block_compression_bypassed COUNT : 5101
rocksdb.number.block_compression_rejected COUNT : 0
rocksdb.bytes.decompressed.from COUNT : 0
rocksdb.bytes.decompressed.to COUNT : 0
rocksdb.merge.operation.time.nanos COUNT : 0
rocksdb.filter.operation.time.nanos COUNT : 0
rocksdb.compaction.total.time.cpu_micros COUNT : 0
rocksdb.row.cache.hit COUNT : 0
rocksdb.row.cache.miss COUNT : 0
rocksdb.read.amp.estimate.useful.bytes COUNT : 0
rocksdb.read.amp.total.read.bytes COUNT : 0
rocksdb.number.rate_limiter.drains COUNT : 0
rocksdb.blobdb.num.put COUNT : 0
rocksdb.blobdb.num.write COUNT : 0
rocksdb.blobdb.num.get COUNT : 0
rocksdb.blobdb.num.multiget COUNT : 0
rocksdb.blobdb.num.seek COUNT : 0
rocksdb.blobdb.num.next COUNT : 0
rocksdb.blobdb.num.prev COUNT : 0
rocksdb.blobdb.num.keys.written COUNT : 0
rocksdb.blobdb.num.keys.read COUNT : 0
rocksdb.blobdb.bytes.written COUNT : 0
rocksdb.blobdb.bytes.read COUNT : 0
rocksdb.blobdb.write.inlined COUNT : 0
rocksdb.blobdb.write.inlined.ttl COUNT : 0
rocksdb.blobdb.write.blob COUNT : 0
rocksdb.blobdb.write.blob.ttl COUNT : 0
rocksdb.blobdb.blob.file.bytes.written COUNT : 0
rocksdb.blobdb.blob.file.bytes.read COUNT : 0
rocksdb.blobdb.blob.file.synced COUNT : 0
rocksdb.blobdb.blob.index.expired.count COUNT : 0
rocksdb.blobdb.blob.index.expired.size COUNT : 0
rocksdb.blobdb.blob.index.evicted.count COUNT : 0
rocksdb.blobdb.blob.index.evicted.size COUNT : 0
rocksdb.blobdb.gc.num.files COUNT : 0
rocksdb.blobdb.gc.num.new.files COUNT : 0
rocksdb.blobdb.gc.failures COUNT : 0
rocksdb.blobdb.gc.num.keys.relocated COUNT : 0
rocksdb.blobdb.gc.bytes.relocated COUNT : 0
rocksdb.blobdb.fifo.num.files.evicted COUNT : 0
rocksdb.blobdb.fifo.num.keys.evicted COUNT : 0
rocksdb.blobdb.fifo.bytes.evicted COUNT : 0
rocksdb.blobdb.cache.miss COUNT : 0
rocksdb.blobdb.cache.hit COUNT : 0
rocksdb.blobdb.cache.add COUNT : 0
rocksdb.blobdb.cache.add.failures COUNT : 0
rocksdb.blobdb.cache.bytes.read COUNT : 0
rocksdb.blobdb.cache.bytes.write COUNT : 0
rocksdb.txn.overhead.mutex.prepare COUNT : 0
rocksdb.txn.overhead.mutex.old.commit.map COUNT : 0
rocksdb.txn.overhead.duplicate.key COUNT : 0
rocksdb.txn.overhead.mutex.snapshot COUNT : 0
rocksdb.txn.get.tryagain COUNT : 0
rocksdb.files.marked.trash COUNT : 0
rocksdb.files.marked.trash.deleted COUNT : 0
rocksdb.files.deleted.immediately COUNT : 3
rocksdb.error.handler.bg.error.count COUNT : 0
rocksdb.error.handler.bg.io.error.count COUNT : 0
rocksdb.error.handler.bg.retryable.io.error.count COUNT : 0
rocksdb.error.handler.autoresume.count COUNT : 0
rocksdb.error.handler.autoresume.retry.total.count COUNT : 0
rocksdb.error.handler.autoresume.success.count COUNT : 0
rocksdb.memtable.payload.bytes.at.flush COUNT : 127474820
rocksdb.memtable.garbage.bytes.at.flush COUNT : 110206555
rocksdb.verify_checksum.read.bytes COUNT : 0
rocksdb.backup.read.bytes COUNT : 0
rocksdb.backup.write.bytes COUNT : 0
rocksdb.remote.compact.read.bytes COUNT : 0
rocksdb.remote.compact.write.bytes COUNT : 0
rocksdb.hot.file.read.bytes COUNT : 0
rocksdb.warm.file.read.bytes COUNT : 0
rocksdb.cold.file.read.bytes COUNT : 0
rocksdb.hot.file.read.count COUNT : 0
rocksdb.warm.file.read.count COUNT : 0
rocksdb.cold.file.read.count COUNT : 0
rocksdb.last.level.read.bytes COUNT : 0
rocksdb.last.level.read.count COUNT : 0
rocksdb.non.last.level.read.bytes COUNT : 35035588
rocksdb.non.last.level.read.count COUNT : 8496
rocksdb.last.level.seek.filtered COUNT : 0
rocksdb.last.level.seek.filter.match COUNT : 0
rocksdb.last.level.seek.data COUNT : 0
rocksdb.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.non.last.level.seek.filtered COUNT : 0
rocksdb.non.last.level.seek.filter.match COUNT : 0
rocksdb.non.last.level.seek.data COUNT : 0
rocksdb.non.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.non.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.block.checksum.compute.count COUNT : 8504
rocksdb.block.checksum.mismatch.count COUNT : 0
rocksdb.multiget.coroutine.count COUNT : 0
rocksdb.read.async.micros COUNT : 0
rocksdb.async.read.error.count COUNT : 0
rocksdb.table.open.prefetch.tail.miss COUNT : 0
rocksdb.table.open.prefetch.tail.hit COUNT : 20
rocksdb.timestamp.filter.table.checked COUNT : 0
rocksdb.timestamp.filter.table.filtered COUNT : 0
rocksdb.readahead.trimmed COUNT : 0
rocksdb.fifo.max.size.compactions COUNT : 0
rocksdb.fifo.ttl.compactions COUNT : 0
rocksdb.prefetch.bytes COUNT : 0
rocksdb.prefetch.bytes.useful COUNT : 1029550
rocksdb.prefetch.hits COUNT : 20
rocksdb.footer.corruption.count COUNT : 0
rocksdb.db.get.micros P50 : 0.551776 P95 : 1.647362 P99 : 2.675575 P100 : 3320.000000 COUNT : 99345378 SUM : 100727893
rocksdb.db.write.micros P50 : 3.794268 P95 : 8.767325 P99 : 9.942519 P100 : 12358.000000 COUNT : 494933 SUM : 2477546
rocksdb.compaction.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compaction.times.cpu_micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.subcompaction.setup.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.sync.micros P50 : 1600.000000 P95 : 2067.000000 P99 : 2067.000000 P100 : 2067.000000 COUNT : 3 SUM : 4433
rocksdb.compaction.outfile.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.wal.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.manifest.file.sync.micros P50 : 347.500000 P95 : 442.000000 P99 : 442.000000 P100 : 442.000000 COUNT : 3 SUM : 1065
rocksdb.table.open.io.micros P50 : 3400.000000 P95 : 3428.000000 P99 : 3428.000000 P100 : 3428.000000 COUNT : 4 SUM : 12017
rocksdb.db.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.get.micros P50 : 184.740637 P95 : 246.026437 P99 : 322.048193 P100 : 3311.000000 COUNT : 8500 SUM : 1422923
rocksdb.write.raw.block.micros P50 : 0.570312 P95 : 2.202857 P99 : 4.942857 P100 : 2302.000000 COUNT : 5110 SUM : 46442
rocksdb.numfiles.in.singlecompaction P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.stall P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.read.micros P50 : 178.646764 P95 : 245.296579 P99 : 314.575887 P100 : 3305.000000 COUNT : 8496 SUM : 1373118
rocksdb.file.read.flush.micros P50 : 3239.000000 P95 : 3239.000000 P99 : 3239.000000 P100 : 3239.000000 COUNT : 2 SUM : 6363
rocksdb.file.read.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.open.micros P50 : 1928.000000 P95 : 1928.000000 P99 : 1928.000000 P100 : 1928.000000 COUNT : 2 SUM : 3851
rocksdb.file.read.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.iterator.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.db.checksum.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.file.checksums.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.write.micros P50 : 0.526308 P95 : 0.999985 P99 : 2.710594 P100 : 2301.000000 COUNT : 10223 SUM : 44363
rocksdb.file.write.flush.micros P50 : 0.524487 P95 : 0.996525 P99 : 2.884598 P100 : 2301.000000 COUNT : 7004 SUM : 29906
rocksdb.file.write.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.write.db.open.micros P50 : 0.530313 P95 : 1.146815 P99 : 1.966943 P100 : 2270.000000 COUNT : 3219 SUM : 14457
rocksdb.num.subcompactions.scheduled P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.read P50 : 267.000000 P95 : 267.000000 P99 : 267.000000 P100 : 267.000000 COUNT : 99345378 SUM : 26525215926
rocksdb.bytes.per.write P50 : 363.000000 P95 : 363.000000 P99 : 363.000000 P100 : 363.000000 COUNT : 494933 SUM : 179660679
rocksdb.bytes.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.decompression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.num.merge_operands P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.key.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.value.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.next.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.prev.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.read.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.compression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.decompression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.flush.micros P50 : 61612.000000 P95 : 61612.000000 P99 : 61612.000000 P100 : 61612.000000 COUNT : 2 SUM : 121398
rocksdb.sst.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.multiget.io.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.index.and.filter.blocks.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.sst.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.level.read.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.error.handler.autoresume.retry.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.async.read.bytes P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.poll.wait.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.prefetched.bytes.discarded P50 : 150000.000000 P95 : 396041.000000 P99 : 396041.000000 P100 : 396041.000000 COUNT : 4 SUM : 865350
rocksdb.async.prefetch.abort.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.open.prefetch.tail.read.bytes P50 : 223333.333333 P95 : 472064.000000 P99 : 472064.000000 P100 : 472064.000000 COUNT : 4 SUM : 1031680